
export const divisions = [
    { name: 'ঢাকা' },
    { name: 'চট্টগ্রাম' },
    { name: 'রাজশাহী' },
    { name: 'খুলনা' },
    { name: 'বরিশাল' },
    { name: 'সিলেট' },
    { name: 'রংপুর' },
    { name: 'ময়মনসিংহ' },
];

export const districts: { [key: string]: string[] } = {
    'ঢাকা': ['ঢাকা', 'গাজীপুর', 'নারায়ণগঞ্জ', 'নরসিংদী', 'মানিকগঞ্জ', 'মুন্সিগঞ্জ', 'ফরিদপুর', 'গোপালগঞ্জ', 'মাদারীপুর', 'রাজবাড়ী', 'শরীয়তপুর', 'কিশোরগঞ্জ', 'টাঙ্গাইল'],
    'চট্টগ্রাম': ['চট্টগ্রাম', 'কক্সবাজার', 'বান্দরবান', 'রাঙ্গামাটি', 'খাগড়াছড়ি', 'কুমিল্লা', 'ব্রাহ্মণবাড়িয়া', 'চাঁদপুর', 'লক্ষ্মীপুর', 'নোয়াখালী', 'ফেনী'],
    'রাজশাহী': ['রাজশাহী', 'বগুড়া', 'পাবনা', 'সিরাজগঞ্জ', 'নওগাঁ', 'নাটোর', 'চাঁপাইনবাবগঞ্জ', 'জয়পুরহাট'],
    'খুলনা': ['খুলনা', 'যশোর', 'সাতক্ষীরা', 'বাগেরহাট', 'নড়াইল', 'মাগুরা', 'ঝিনাইদহ', 'কুষ্টিয়া', 'চুয়াডাঙ্গা', 'মেহেরপুর'],
    'বরিশাল': ['বরিশাল', 'পটুয়াখালী', 'ভোলা', 'পিরোজপুর', 'বরগুনা', 'ঝালকাঠি'],
    'সিলেট': ['সিলেট', 'সুনামগঞ্জ', 'হবিগঞ্জ', 'মৌলভীবাজার'],
    'রংপুর': ['রংপুর', 'দিনাজপুর', 'গাইবান্ধা', 'কুড়িগ্রাম', 'লালমনিরহাট', 'নীলফামারী', 'পঞ্চগড়', 'ঠাকুরগাঁও'],
    'ময়মনসিংহ': ['ময়মনসিংহ', 'জামালপুর', 'শেরপুর', 'নেত্রকোনা'],
};

export const upazilas: { [key: string]: string[] } = {
    'ঢাকা': ['রমনা', 'মতিঝিল', 'ধানমন্ডি', 'মোহাম্মদপুর', 'উত্তরা', 'গুলশান'],
    'চট্টগ্রাম': ['কোতোয়ালী', 'পাঁচলাইশ', 'ডবলমুরিং', 'চান্দগাঁও', 'হালিশহর', 'খুলশী'],
    'রাজশাহী': ['বোয়ালিয়া', 'শাহমখদুম', 'মতিহার', 'রাজপাড়া'],
    'খুলনা': ['খুলনা সদর', 'সোনাডাঙ্গা', 'দৌলতপুর'],
    'সাতক্ষীরা': ['সাতক্ষীরা সদর', 'আশাশুনি', 'দেবহাটা', 'কলারোয়া', 'কালিগঞ্জ', 'শ্যামনগর', 'তালা'],
    'সিলেট': ['সিলেট সদর', 'দক্ষিণ সুরমা', 'শাহপরাণ'],
    'বরিশাল': ['বরিশাল সদর', 'বন্দর'],
    'রংপুর': ['রংপুর সদর', 'তাজহাট'],
    'ময়মনসিংহ': ['ময়মনসিংহ সদর', 'ত্রিশাল'],
    'গাজীপুর': ['গাজীপুর সদর', 'কালিয়াকৈর', 'কাপাসিয়া', 'শ্রীপুর', 'কালীগঞ্জ'],
    'নারায়ণগঞ্জ': ['নারায়ণগঞ্জ সদর', 'বন্দর', 'রূপগঞ্জ', 'সোনারগাঁও', 'আড়াইহাজার'],
    'কক্সবাজার': ['কক্সবাজার সদর', 'চকরিয়া', 'উখিয়া', 'টেকনাফ', 'মহেশখালী', 'কুতুবদিয়া', 'রামু', 'পেকুয়া'],
    'কুমিল্লা': ['কুমিল্লা সদর', 'লাকসাম', 'দাউদকান্দি', 'চান্দিনা', 'হোমনা', 'মুরাদনগর', 'দেবিদ্বার', 'বুড়িচং'],
    'বগুড়া': ['বগুড়া সদর', 'শাজাহানপুর', 'শেরপুর', 'ধুনট', 'সারিয়াকান্দি', 'গাবতলী', 'সোনাতলা', 'শিবগঞ্জ'],
    'যশোর': ['যশোর সদর', 'শার্শা', 'ঝিকরগাছা', 'চৌগাছা', 'কেশবপুর', 'অভয়নগর', 'মনিরামপুর', 'বাঘারপাড়া'],
};
